Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཇི་སྐད་ཟེར་བ་བཞིན་ཏེ། ཆོས་ཐམས་ཅད་ནི་ཡིད་ལ་བྱེད་པ་ལས་འབྱུང་སྟེ།
en: The Blessed One said, “Great king, you have described things accurately, for all phenomena do indeed arise from mental engagement.

source: ཆོས་ཐམས་ཅད་བྱེད་པ་མེད་པའི་ཕྱིར་དེ་དག་ནི་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་རྣམ་པར་འགྲུབ་བོ།
en: Because all phenomena are without a creator, they come into being in accord with one’s desires.”

source: །དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀླུའི་བདག་པོ་གང་ཁྱོད་དེ་བཞིན་གཤེགས་པས་འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་རྒྱན་བཀོད་པ་བསམ་གྱིས་མི་ཁྱབ་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ནི་ཁྱོད་ཀྱིས་རྙེད་པ་ལེགས་པར་རྙེད་དོ།
en: King Ajātaśatru turned to Nāga King Sāgara and commented, “Nāga Lord, you have received a gift, a great gift, in being prophesied to attain unsurpassed and perfect awakening with such unfathomable displays of enhancing qualities within your buddha realm.”

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་ཆོས་གང་ཡང་ལུང་བསྟན་དུ་མེད་དོ།
en: Nāga King Sāgara responded to King Ajātaśatru, saying, “Great king, there are no phenomena to be prophesied.

source: ཆོས་ཐམས་ཅད་ནི་གཟོད་མ་ནས་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: Because all phenomena are primordially pure.”

source: །རྒྱལ་པོས་སྨྲས་པ། ཀླུའི་བདག་པོ་སྔོན་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་རྣམས་ཀྱང་ལུང་བསྟན་དུ་མེད་དམ།
en: The king said, “Nāga Lord, are there not prophecies for those who have previously developed the roots of virtue?”

source: ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་སེམས་ཅན་དུ་གདགས་པ་ནི་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་སུ་ཟད་ལ། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་རྣམས་ནི་ལུང་བསྟན་དུ་མེད་དོ།
en: Nāga King Sāgara said, “Great king, what we term a sentient being is encapsulated by the aggregates, elements, and sense sources, yet the aggregates, elements, and sense sources cannot be prophesied.

source: །རྒྱལ་པོ་ཆེན་པོ་མིང་དང་གཟུགས་ལ་སེམས་ཅན་དུ་གདགས་པར་ཟད་ལ།
en: Great king, it is entirely to name and form that the term sentient being is applied.

source: མིང་དང་གཟུགས་ལ་ལུང་བསྟན་དུ་མེད་དོ།
en: Yet name and form cannot be prophesied.

source: །རྒྱུ་དང་། ལྟ་བ་དང་། འདུ་ཤེས་དང་། ཡིད་ལ་བྱེད་པ་ལས་སེམས་ཅན་དུ་གདགས་པར་ཟད་ན།
en: It is entirely based on cause, perspective, perception, and mental engagement that the term sentient being is applied.

source: རྒྱུ་དང་། ལྟ་བ་དང་། འདུ་ཤེས་དང་། ཡིད་ལ་བྱེད་པ་དེ་ལ་ཡང་ལུང་བསྟན་དུ་མེད་དོ།
en: Yet, cause, perspective, perception, and mental engagement cannot be prophesied.

source: །དགེ་བའི་རྩ་བ་གང་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡང་དག་པར་འགྲུབ་པའི་དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་ལུང་བསྟན་དུ་མེད་དོ།
en: Even the roots of virtue that actually create the bodhisattva’s omniscience cannot be prophesied.

source: །རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་ཡིན་ལ།
en: “Great king, all phenomena have the essential characteristic of emptiness.

source: སྟོང་པ་ཉིད་ནི་ལུང་བསྟན་དུ་མེད་དོ།
en: Yet emptiness cannot be prophesied.

source: །རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་མཚན་ཉིད་ཡིན་ལ་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་མཚན་ཉིད་ནི་ལུང་བསྟན་དུ་མེད་པའོ།
en: Great king, all phenomena have the essential characteristic of the absence of marks, the absence of wishes, and unconditionedness. Yet the absence of marks, the absence of wishes, and unconditionedness cannot be prophesied.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་སངས་རྒྱས་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོ་འདི་ནི་བསམ་གྱིས་མི་ཁྱབ་སྟེ།
en: Great king, furthermore, the great compassion of buddhas is unfathomable.

source: མིང་མེད་པ་དང་། མཚན་མ་མེད་པའི་ཆོས་ཐམས་ཅད་མིང་དང་མཚན་མས་སྟོན་པར་མཛད་ལ།
en: Phenomena that have no name or mark are all described using names and marks.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་མིང་དང་། མཚན་མའི་རྗེས་སུ་འབྲང་བའི་རྣམ་པར་ཤེས་པ་ཅན་ཡང་མ་ཡིན་ནོ།
en: Yet the blessed buddhas do not have a consciousness that pursues names and marks.

source: །རྒྱལ་པོ་ཆེན་པོ་ལུང་བསྟན་པ་འདི་ནི་འཇིག་རྟེན་བརྡ་སྤྲད་པར་ཟད་དེ། འདི་ལ་གང་ལུང་བསྟན་པར་བྱ་བའི་ཆོས་གང་ཡང་ནང་ངམ་ཕྱི་རོལ་ན་མི་དམིགས་སོ།
en: Great king, these prophesies are just for conventional worldly communication, since there are no phenomena in this regard that can be apprehended, either internally or externally, as something that can be prophesied.”

source: །རྒྱལ་པོས་སྨྲས་པ། ཀླུའི་བདག་པོ་བཟོད་པ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལུང་བསྟན་པ་མེད་དམ། སྨྲས་པ།
en: The king said, “Nāga Lord, can bodhisattva great beings who reach acceptance not be prophesied?”

source: རྒྱལ་པོ་ཆེན་པོ་བཟོད་པ་དེ་ཡང་སྐད་ཅིག་པ། ཟད་པའི་མཚན་ཉིད། མི་ཟད་པའི་མཐའ་ཅན། ཡང་དག་པའི་མཐར་ངེས་པ། མཉམ་པའི་མཐའ་ཅན།
en: “Great king, even that acceptance is momentary and has the characteristics of exhausting, the inexhaustible limit, certainty in the limit of reality, the limit of sameness, and certainty in the limit of nonduality.

source: གཉིས་སུ་མེད་པའི་མཐར་ངེས་པ་སྟེ། གཉིས་སུ་མེད་པའི་མཐའ་ནི་ཡང་དག་པའི་མཐའོ།
en: The limit of nonduality is the limit of reality.

source: །ཡང་དག་པའི་མཐའ་ནི་གཏན་དུ་མི་འབྱུང་བའི་མཐའོ།
en: The limit of reality is the limit of never arising.

source: །མཐའ་ཅན་གང་ཡིན་པ་དེ་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རྣམས་སོ།
en: Anything that is limited involves attachment, aggression, and delusion.

source: །དེའི་མཐའ་ཅན་ནི་རྣམ་པར་གྲོལ་བའི་མཐའོ།
en: That which is limited is the limit of liberation.

source: །གང་མཐའ་དེའི་སྒོར་ཞུགས་པ་ནི་གང་དུ་ཡང་མངོན་པར་ཞེན་པ་མེད་དོ།
en: Whoever enters the door of that limit has no clinging to anything whatsoever.

source: །གང་མངོན་པར་ཞེན་པ་མེད་པ་དེ་ནི་ཐ་སྙད་ཀྱི་བརྡ་ལ་ཆགས་པ་མེད་དོ།
en: Whoever has no clinging whatsoever is without attachment on the level of conventional communication.

source: །མ་ཆགས་ན་གྲོལ་བར་འགྱུར་རོ།
en: Without attachment, one is liberated.

source: །གྲོལ་ན་ཕྱིན་ཅད་མི་རྒྱུ་རབ་ཏུ་མི་རྒྱུའོ།
en: If liberated, one will henceforth be unmoving, absolutely unmoving.

source: །མི་རྒྱུ་རབ་ཏུ་མི་རྒྱུ་ན་གང་དུ་ཡང་ཉམས་པར་མི་འགྱུར་རོ།
en: If one is unmoving, absolutely unmoving, there can be no degeneration at all.

source: །བློ་མ་ཉམས་ན་ཐམས་ཅད་ལས་ངེས་པར་འབྱུང་བར་མཐོང་སྟེ། ཇི་ལྟར་རྣམ་པར་མི་མཐོང་བ་དེ་ནི་དེ་ལྟར་ཡང་མཐོང་ངོ་།
en: If the mind does not degenerate, one will see emancipation from everything, for by not looking, one correspondingly sees.

source: །གང་གི་ཚེ་རྣམ་པར་མི་མཐོང་བ་དེའི་ཚེ་གཉིས་སུ་མི་འབྱེད་དོ།
en: When one does not look, there is no division into duality.

source: །གཉིས་སུ་མེད་པ་ལ་གནས་ན་མཉམ་པ་ཉིད་ལ་འཇུག་གོ།
en: If one abides in nonduality, one enters sameness.

source: །མཉམ་པ་ཉིད་ལ་ཞུགས་ན་མཐོ་བར་ཡང་མི་འགྱུར་དམའ་བར་ཡང་མི་འགྱུར་རོ།
en: If one has entered sameness, there will be no high or low.

source: །མཐོ་བ་ཡང་མེད། དམའ་བ་ཡང་མེད་ན་མཉམ་པ་ཉིད་ཀྱི་ཆོས་ཀྱིས་རབ་ཏུ་ཕྱེ་བའི་བཟོད་པ་ཐོབ་པར་འགྱུར་ཏེ།
en: If there is no high or low, one will reach the acceptance that discerns via the quality of sameness.

source: དེ་ལ་བཟོད་པ་གང་ཡིན་པ་དང་། ལུང་བསྟན་པ་གང་ཡིན་པ་དང་། གང་ལུང་བསྟན་པར་བྱ་བ་དང་། སུས་ལུང་བསྟན་པ་དང་། ཅིའི་ཕྱིར་ལུང་བསྟན་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ཆོས་མཉམ་པ་དང་། ཆོས་མེད་པའི་ཆོས་ཀྱི་དབྱིངས་སུ་ངེས་པ་དང་། བརྡ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། དངོས་པོ་དང་། དངོས་པོ་མེད་པ་དང་བྲལ་བ་དང་། གཉིས་སུ་མེད་པའི་མཐའ་ཅན་དེ་དག་གི་དོན་ཡོངས་སུ་གཞལ་ནས།
en: In this vein, all the phenomena of acceptance, prophecy, something to be prophesied, a prophet, and someone for whom the prophecy is given are understood to be the same phenomena, the realm of phenomena devoid of phenomena, incommunicable, nonarising, neither entities nor nonentities, and the very limit of nonduality.

source: ཆོས་གང་ཡང་བགྲང་བར་མི་བྱེད་དོ།
en: Thus, one does not take notice of any phenomena whatsoever.

source: །དཔེར་ན་ནམ་མཁའ་ནི་བགྲང་དུ་མེད་ཅིང་བགྲང་བ་ལས་ཡང་དག་པར་འདས་པ་སྟེ།
en: To draw an analogy, space cannot be viewed; it is beyond what can be viewed.

source: དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་བར་བལྟ་བར་བྱའོ།
en: One should view all phenomena in this way.”

source: །ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་བསྟན་པ་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉིས་བརྒྱ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: When Nāga King Sāgara gave his teaching, two hundred bodhisattvas reached the acceptance that phenomena are unborn.

source: །དགེ་སློང་ཉིས་བརྒྱ་ནི་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ།
en: Two hundred monks liberated their minds from defilement without any reoccurrence.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོའི་སྤོབས་པ་ནི་ངོ་མཚར་ལགས་སོ།
en: King Ajātaśatru then said to the Blessed One, “Blessed One, Nāga King Sāgara’s eloquence is incredible.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་འདིའི་སྤོབས་པ་ནི་ངོ་མཚར་ཡང་མི་ཆེ་ལ་དཀའ་བ་ཡང་མ་ཡིན་གྱི།
en: The Blessed One replied, “Great king, such eloquence is not so incredible or difficult.

source: ལས་དང་པོ་པ་གང་དག་གིས་བསྟན་པ་འདི་ཐོས་ན་མི་སྐྲག །མི་དངང་དངང་བར་མི་འགྱུར་བ་འདི་ནི་དེ་དག་གི་ཆེས་ངོ་མཚར་ཆེ་བ་དང་། ཆེས་དཀའ་བ་ཡིན་ནོ།
en: In fact, if any beginner were to hear this teaching without becoming intimidated, threatened, or scared, that would be more incredible and difficult.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་ནི་དེ་ལྟར་མོས་པར་དཀའ་བ་སྟེ། དེ་ལ་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་འཇུག་པར་མི་འགྱུར། འགྲོ་བར་མི་འགྱུར། མོས་པར་མི་འགྱུར། ཡིད་ཆེས་པར་མི་འགྱུར་བའི་ཕྱིར་ཏེ།
en: The awakening of the blessed buddhas is difficult even to aspire to, for the world and its gods cannot grasp it, travel to it, aspire to it, or trust it.

source: རྒྱལ་པོ་ཆེན་པོ་རྣམ་གྲངས་འདིས་ཀྱང་གང་དག་ཆོས་ཟབ་མོ་བསྟན་པ་འདི་ལ་མི་སྐྲག །མི་དངང་ཞིང་དངང་བར་མི་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ནི་སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ་ཡིན་པར་དེ་ལྟར་རིག་པར་བྱའོ།
en: Great king, understand that anyone who is not intimidated, threatened, or scared by this teaching has already served many buddhas.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་འདི་ཅི་སྙམ་དུ་སེམས། སྐྱེས་བུ་གང་གིས་ནམ་མཁའ་གཟུགས་ཅན་མ་ཡིན་པ་བསྟན་དུ་མེད་པ་འདི་གཟུགས་ཅན་དུ་སྟོན་པར་བྱེད་ན། ཅི་དེ་དཀའ་བར་བྱེད་པ་ཡིན་ནམ།
en: Now tell me, great king, would it be difficult for someone to make space, which is formless and indescribable, appear as something that has form?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཆོག་ཏུ་དཀའ་བ་ལགས་སོ།
en: “It would be supremely difficult, Blessed One.

source: །བདེ་བར་གཤེགས་པ་མཆོག་ཏུ་དཀའ་བ་ལགས་སོ། །བཀའ་སྩལ་པ། ཆོས་འདི་ལྟ་བུར་ཟབ་པ། ཟབ་པར་སྣང་བ། ཚོར་བ་ཐམས་ཅད་རྒྱུན་ཆད་པ། བདག་མེད་པ།
en: Supremely difficult, Well-Gone One.”

source: སེམས་ཅན་མེད་པ། སྲོག་མེད་པ། གསོ་བ་མེད་པ། གང་ཟག་མེད་པ། རྒྱུ་བ་མེད་པ་འདི་ལ་མོས་ལ་མོས་ནས་ཀྱང་དེ་ཁོ་ན་བཞིན་དུ་སྒྲུབ་པ་གང་ཡིན་པ་དེ་དག་ནི་དེ་བས་ཀྱང་ཆེས་དཀའ་བ་བྱེད་པ་ཡིན་ཏེ།
en: “Now, it is far more difficult for someone to aspire to a Dharma that is this profound, deeply illuminating, disruptive of all feeling, and without self, being, life principle, soul, personhood, or movement, and to realize this reality as it is it.

source: དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་འཐུན་པའི་དགེ་བ་དང་། གྲོགས་དང་། མཛའ་བཤེས་ཡིན་ནོ།
en: Such beings have the virtue that accords with the thus-gone ones, and they are their friends and relatives.

source: །དེ་དག་གིས་ནི་སེམས་ཅན་རྣམས་ཀྱི་ཕྱིན་ཅི་ལོག་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ནུས་སོ།
en: Because they have abandoned the mistaken ways of beings, they are able to teach the Dharma.

source: །དེ་དག་གིས་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པ་ལ་འདུག་ནས་བདུད་ཀྱི་དཔུང་བྱེ་བ་ཕྲག་བརྒྱ་བྱམས་པ་དང་། ཤེས་རབ་དང་། ཡེ་ཤེས་དང་། བརྩོན་འགྲུས་ཀྱིས་གཞོམ་པར་ནུས་སོ།
en: Because they dwell at the supreme seat of awakening, they are able to defeat billions of māras with love, insight, wisdom, and diligence.

source: །དེ་དག་གིས་ནི་ཆོས་ཐམས་ཅད་ལ་དབང་བྱེད་པ་དང་། སེམས་དཔའ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངོན་སུམ་དུ་བྱེད་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་དང་ལྡན་པས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ནུས་སོ།
en: They are capable of mastering all phenomena, being brave, manifesting the wisdom of omniscience, and fully awakening to the wisdom of omniscience through the momentariness of mind.

source: །དེ་དག་གིས་ནི་སེམས་ཅན་ཐམས་ཅད་བརྡ་སྤྲད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ། ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པས་ཆོས་ཀྱི་འཁོར་ལོ་བླ་ན་མེད་པ་བསྐོར་བར་ནུས་སོ།
en: Because they communicate with all beings, understand the minds of all beings as they really are, and correctly understand the faculties of beings, supreme or otherwise, they are able to turn the unsurpassed wheel of Dharma.

source: །དེ་དག་གིས་ནི་ཕས་ཀྱི་རྒོལ་བ་རྣམས་ཚར་གཅད་པ་དང་། མུ་སྟེགས་ཅན་ཐམས་ཅད་ཟིལ་གྱིས་མནན་པ་དང་། དགྲ་ཐམས་ཅད་ཚར་གཅད་པའི་ཕྱིར་ཆོས་ཀྱི་དུང་འབུད་ནུས་སོ།
en: Because they destroy the attacks of adversaries, outshine all extremists, and defeat all enemies, they are able to blow the conch of Dharma.”

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་བསམ་པ་གྲུབ་ཅིང་བརྣག་པ་དང་། ཡིད་ལ་བསམ་པ་ཡོངས་སུ་རྫོགས་ཏེ་རང་གིས་ལུང་བསྟན་པ་ཐོས་ནས་བར་སྣང་ལ་མངོན་པར་འཕགས་ཏེ།
en: Nāga King Sāgara’s wishes were thus achieved, brought to mind, and totally fulfilled.

source: བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ།
en: Having heard his prophecy, he rose into the sky and sang the following verses to the Blessed One:

source: །བདུད་རྣམས་སྡེ་བཅས་དཔུང་བཅས་ངེས་བཅོམ་ཞིང་།
en: “Having defeated the māras, their hosts, and their hordes,

source: །ལྟ་བ་ངན་པའི་ཚོགས་ཀུན་བཤིག་ནས་ནི།
en: You destroyed the mass of negative views.

source: །ཐུབ་པ་ཆེན་པོས་ཆོས་ཀྱི་ཆར་ཕབ་སྟེ།
en: Great Sage, you make the Dharma rain down,

source: །འཇིག་རྟེན་ཐམས་ཅད་བདུད་རྩིས་ཚིམ་པར་མཛད།
en: Satisfying the entire world with its nectar.

source: །ཁྱོད་ནི་ཆོས་རྒྱལ་མི་འཇིགས་སྩོལ་བ་ལགས།
en: “You are the Dharma King, capable of bestowing fearlessness.

source: །འདམ་ལས་རྒལ་ཏེ་འཇིགས་མེད་འགྲམ་ན་བཞུགས།
en: Freed from the mire, you live on the shores of fearlessness.

source: །འཇིག་རྟེན་མིག་སྟེ་ལམ་མཆོག་སྟོན་པ་པོ།
en: You are a teacher of the supreme path for those with worldly eyes

source: །སྐྱེ་བོ་སྐྱབས་མ་མཆིས་པའི་མགོན་པོ་ལགས།
en: And the protector of beings without refuge.

source: །སྨན་པའི་རྒྱལ་ཁྱོད་ཟུག་རྔུ་འབྱིན་པ་ཡི།
en: “O King of Physicians, who delivers us from anguish,

source: །སྨན་པ་རྒ་ཤི་མེད་པའི་སྨན་སྩོལ་བ།
en: You bestow the medicine that eliminates aging and death.

source: །ཅི་ནས་ཕྱིན་ཆད་ནད་རྣམས་མི་འབྱུང་བར།
en: To ensure that henceforth there will be no ailing beings,

source: །ནད་དང་རྒ་བས་གཟིར་རྣམས་གསོ་མཛད་པ།
en: You heal those tormented by sickness and aging.

source: །ཁྱོད་ནི་སྟོན་སྐྱབས་བླ་མ་གཅིག་པུ་ལགས།
en: “You are our sole teacher, refuge, and master.

source: །གཏན་དུ་བདེ་བ་སྦྱིན་པ་ཁྱོད་ཉག་གཅིག །ཁྱོད་ནི་རུ་སྐྱ་འཛིན་པ་དོན་དམ་མཁྱེན་པ་ལགས།
en: Only you can give ultimate happiness. Taking the oars, you know ultimate reality

source: །འཁོར་བའི་སྡུག་བསྔལ་ལས་ནི་ཟློག་མཛད་པ།
en: And turn us away from the suffering of saṃsāra.

source: །ལྷ་ཡི་ལྷ་སྟེ་འགྲོ་བ་རྣམས་ཀྱི་གཙོ།
en: “O god among gods, greatest of beings

source: །འཇིག་རྟེན་ཀུན་གྱི་སྒྲོན་མར་གྱུར་པ་ལགས།
en: Who is the lamp for the whole world,

source: །ཁྱོད་དང་མཇལ་ན་འཇིག་རྟེན་ཆུ་ཆེན་རྒལ།
en: To meet you is to cross the oceans of existence.

source: །མི་རྣམས་ཀྱི་ནི་མི་མཆོག་ཁྱོད་ཉག་གཅིག །ཡེ་ཤེས་གཟུགས་དང་ཕ་རོལ་གནོན་པ་ཡིས།
en: You alone are the greatest human.

source: །ཐུབ་དབང་ཁྱོད་འདྲ་སུ་ཡང་མ་མཆིས་ཏེ།
en: “O Lord of Sages, there is no one like you Who has such wisdom and form and has vanquished all opponents.

source: །ཁྱོད་ནི་ལྷར་བཅས་འཇིག་རྟེན་ཐམས་ཅད་ཀྱི།
en: You are the teacher for the entire world with its gods,

source: །སྟོན་པ་པོ་སྟེ་ཐར་པའི་ལམ་མཚོན་ལགས།
en: Showing the path of freedom.

source: །ཁྱོད་ནི་ཐམས་ཅད་ཟིལ་མནན་ཀུན་མཁྱེན་མཆོག །འཇིག་རྟེན་ཆོས་རྣམས་ཀྱིས་ནི་ཁྱོད་མ་གོས།
en: “Your supreme omniscience outshines everything, And you are unstained by the phenomena of the world.

source: །ཀུན་མཁྱེན་སྲེད་བྲལ་རྣམ་གྲོལ་དཔའ་བ་དང་། །ཡེ་ཤེས་མཆོག་བརྙེས་ཁྱོད་ལ་བདག་ཕྱག་འཚལ།
en: I prostrate to you who have achieved omniscience, freedom from clinging, Liberation, courage, and supreme wisdom! “The guide of the world has declared That all phenomena are pure and immaculate,

source: །ཇི་ལྟར་བར་སྣང་ནམ་མཁའ་རྣམ་པར་དག །གཟུགས་མེད་གཟུང་དུ་མ་མཆིས་འདུས་མ་བགྱིས། །དེ་བཞིན་ཆོས་རྣམས་དྲི་མེད་རྣམ་པར་དག །འཇིག་རྟེན་རྣམ་པར་འདྲེན་པས་རབ་ཏུ་བསྟན།
en: Just as space in the atmosphere is pure, Formless, imperceptible, and unconditioned.

source: །ཡོད་དང་མེད་པར་ལྟ་བ་སྤངས་ནས་ཀྱང་།
en: “Though he has dispelled all views of existence and nonexistence,

source: །རྣམ་དག་ཆོས་རྣམས་བདེ་བར་གཤེགས་པས་གསུངས།
en: The Well-Gone One teaches that phenomena are pure.

source: །རྐྱེན་དང་བཅས་ཤིང་རྒྱུ་དང་བཅས་པ་སྟེ།
en: As they involve conditions and involve causes,

source: །སེམས་ཅན་མ་མཆིས་གང་ཟག་སྲོག་མ་མཆིས།
en: There is no being, person, or life principle.

source: །གཟོད་ནས་རྣམ་དག་ནམ་མཁའི་ངོ་བོ་ཉིད།
en: “The essence of space, primordially pure,

source: །སྒྱུ་མ་སྨིག་རྒྱུ་ཆུ་ཟླ་འདྲ་བ་སྟེ།
en: Is like illusions, mirages, or moons reflected on water.

source: །ཤིན་ཏུ་དག་པ་ནམ་མཁའི་ངོ་བོ་ཉིད།
en: The pure essence of space

source: །གནས་པ་མ་མཆིས་གློག་དང་འདྲ་བའི་ཚུལ།
en: Is, like lightning, not located anywhere.

source: །སྔོན་གྱི་མཐའ་སྟོང་ཕྱི་མའི་མཐའ་ཡང་སྟོང་།
en: “The past is empty, and empty too is the future.

source: །སྐྱེ་དང་འཇིག་དང་གནས་པའི་ངོ་བོ་སྟོང་།
en: The essence of birth, abiding, and destruction is empty.

source: །འདིར་ནི་འདི་དག་དངོས་མེད་དངོས་མེད་མིན།
en: Here, such things are neither entities nor nonentities;

source: །འདི་དག་ཐམས་ཅད་རང་བཞིན་མ་མཆིས་སྟོང་།
en: Their nature is nonexistent, empty.

source: །ཆོས་དབྱིངས་རང་བཞིན་ངོ་བོ་གང་ལགས་དེ།
en: “The essential nature of the realm of phenomena

source: །སེམས་ཅན་ཁམས་ཀྱི་རང་བཞིན་ངོ་བོ་ལགས།
en: Is the essential nature of the element of sentient beings.

source: །སེམས་ཅན་ཁམས་ཀྱི་རང་བཞིན་ངོ་བོ་གང་།
en: The essential nature of the element of sentient beings

source: །སངས་རྒྱས་ཆོས་ཀྱི་རང་བཞིན་ངོ་བོ་དེ།
en: Is the essential nature of the buddha qualities.

source: །སངས་རྒྱས་ཆོས་ཀྱི་རང་བཞིན་ངོ་བོ་གང་།
en: “The essential nature of the buddha qualities

source: །དེ་ནི་ཆོས་ཀུན་རང་བཞིན་ངོ་བོ་ཉིད།
en: Is the essential nature of all phenomena.

source: །ཆོས་ཀུན་རང་བཞིན་ངོ་བོ་གང་ལགས་པ།
en: The essential nature of all phenomena

source: །སངས་རྒྱས་ཞིང་གི་ངོ་བོ་རང་བཞིན་ཏེ།
en: Is the essential nature of the buddha realms.

source: །སངས་རྒྱས་ཞིང་གི་རང་བཞིན་ངོ་བོ་གང་།
en: “The essential nature of the buddha realms

source: །སངས་རྒྱས་བྱང་ཆུབ་རང་བཞིན་ངོ་བོ་དེ།
en: Is the essential nature of the buddhas’ awakening.

source: །སངས་རྒྱས་བྱང་ཆུབ་རང་བཞིན་ངོ་བོ་གང་།
en: The essential nature of the buddhas’ awakening

source: །དེ་ནི་ཆོས་དབྱིངས་རང་བཞིན་ངོ་བོ་ཉིད། །ཆོས་རྣམས་ཀུན་ལ་རྣམ་པར་དག་པ་འདི།
en: Is the essential nature of the realm of phenomena.

source: །གང་ཚེ་བྱང་ཆུབ་སེམས་དཔས་དེ་ལྟར་མཐོང་།
en: “When bodhisattvas see in this way The purity of all phenomena,

source: །དེ་ནས་རྒྱལ་རྣམས་ཡེ་ཤེས་དམ་པ་ཡིས། །བྱང་ཆུབ་མཆོག་ཏུ་དེ་ནི་ལུང་སྟོན་མཛད།
en: The victors will then bestow a prophecy of supreme awakening Through their sublime wisdom.

source: །ཆོས་རྣམས་བརྡ་དང་མིང་དང་ཐ་སྙད་ཙམ།
en: “As phenomena are merely marks, labels, and conventions,

source: །མཉམ་པ་ལགས་ཏེ་མི་བདེན་མིང་དུ་བཏགས།
en: They are the same in being unreal, imputed names.

source: །དེ་དག་སྔོན་ཆད་སུས་ཀྱང་མ་ཐོབ་སྟེ།
en: No one could acquire them in the past,

source: །དེ་དག་གིས་ནི་མིང་རྣམས་ཀུན་ཏུ་བརྗོད།
en: Yet they continually utter these names.

source: །མིང་མ་མཆིས་པར་མིང་ནི་རྣམ་པར་བརྟགས།
en: “Names are given to the nameless.

source: །ཆོས་རྣམས་སྟོང་སྟེ་རང་བཞིན་རྣམ་པར་དག །འཇིག་རྟེན་འདུ་ཤེས་མཁས་པར་རིག་ནས་ནི།
en: Phenomena are empty, pure by nature. Those who skillfully know worldly perceptions

source: །ཐ་སྙད་ཙམ་ལ་ཀུན་ཏུ་སྤྱད་པར་བགྱི།
en: Act according to mere conventions.

source: །ཆོས་ཀུན་སྒྱུ་མ་བཞིན་དུ་རིག་ནས་ཀྱང་།
en: “Knowing that all phenomena are like an illusion,

source: །མི་བདེན་སྙིང་པོ་མ་མཆིས་རྨི་ལམ་འདྲ།
en: They are known to be unreal and coreless like dreams.

source: །རྣམ་སྨིན་རྒྱུ་དང་ཉིང་མཚམས་སྦྱོར་བ་ཙམ།
en: Their ripening is merely causes and their interactions.

source: །དེ་ལ་བདེན་པའི་འདུ་ཤེས་ཡོད་མི་བགྱི།
en: They are notions of reality that do not exist.

source: །ཆོས་ཀུན་སླུ་བར་བགྱིད་ཅིང་འཇིགས་པ་ལགས།
en: “All phenomena are deceptive and frightening.

source: །སྒྱུ་མ་སྨིག་རྒྱུ་འདྲ་སྟེ་མི་བདེན་པ།
en: They are unreal, like illusions and mirages.

source: །མགལ་མེའི་འཁོར་ལོ་གཟུགས་བརྙན་འདྲ་བ་ལགས།
en: They are like reflections and whirling firebrands,

source: །རྟག་ཏུ་བྱིས་པའི་སྐྱེ་བོ་རྨོངས་པར་བགྱིད།
en: Constantly confounding the immature.

source: །བྱིས་པས་བདག་དང་བདག་གིར་འདིར་བརྟགས་ནས།
en: “By imputing me and mine , these childish beings,

source: །བླུན་པོ་སྲེད་པས་གཟིར་བ་འདིར་རྨོངས་ཏེ།
en: These fools, are tormented by their craving and deluded.

source: །འཁོར་བའི་འཁོར་ལོས་ཡོངས་སུ་འཁོར་བ་ན།
en: As the wheel of saṃsāra rolls along,

source: །སྡུག་བསྔལ་གྱིས་ནོན་ཞི་བ་འཐོབ་མི་འགྱུར།
en: They will be oppressed by suffering and never achieve peace.

source: །འགྲོ་བའི་འཇུག་པ་འདི་ནི་ཡང་དག་མིན།
en: “This way that beings perceive is unreal,

source: །གང་གི་འཇུག་པ་དེ་ནི་མ་མཆིས་ཏེ།
en: Nor is there even anyone who perceives.

source: །འཚོ་བའི་འཇིག་རྟེན་ལྟ་བ་གཏི་མུག་ལྡོངས།
en: The views of the living world are blinded by delusion,

source: །རྒྱུན་དུ་ཡང་དང་ཡང་དུ་སྡུག་བསྔལ་རྙེད།
en: And so beings continually encounter suffering, again and again.

source: །ལྷ་རྣམས་སྡུག་བསྔལ་འཆི་འཕོའི་ཆོས་གཅིག་པ།
en: “The gods’ only experience of suffering is death and transmigration.

source: །མི་རྣམས་ཀྱི་ནི་སྡུག་བསྔལ་ཚོལ་ཁྲོ་ལགས།
en: The suffering of humans is in their restless seeking.

source: །དམྱལ་བ་དག་གི་སྡུག་བསྔལ་གནོད་པ་རྣམས།
en: The suffering of hell beings is in the terrors they encounter.

source: །གཅིག་ལ་གཅིག་འཚལ་དུད་འགྲོ་རྣམས་ཀྱི་ལགས།
en: For animals, it is how they prey on one another.

source: །ཡི་དགས་སྡུག་བསྔལ་འདི་ན་བཀྲེས་དང་སྐོམ།
en: “The suffering of hungry ghosts is hunger and thirst.

source: །འཇིག་རྟེན་ཐམས་ཅད་སྡུག་བསྔལ་རྣམས་སུ་ནུབ།
en: All worlds are mired in suffering.

source: །སྐྱབས་མེད་གྱུར་དང་རྟེན་མེད་གྱུར་པ་ཡི། །འཇིག་རྟེན་སྡུག་བསྔལ་ཐམས་ཅད་གཟིགས་ནས་ནི།
en: Seeing the sufferings of all the worlds That are without refuge or support,

source: །དྲང་སྲོང་ཆེན་པོ་ཐུགས་བརྩེ་ཐུགས་རྗེ་ཅན།
en: “The Great Sage is loving and compassionate

source: །སྡུག་བསྔལ་རྣམ་པར་དགྲོལ་ཕྱིར་འབྱུང་བར་མཛད།
en: And sets out to liberate them from suffering. Bodhisattvas must be stable in their asceticism and diligent in the perfections,

source: །བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་མང་བྱེ་བར་ཡང་། །བརྟུལ་ཞུགས་བརྟན་ཞིང་ཕ་རོལ་ཕྱིན་ལ་བརྩོན།
en: Even throughout billions of eons.

source: །སྲིད་མ་མཆིས་པ་དེ་འདྲ་མཁྱེན་ནས་ནི།
en: “Understanding that there is no existence,

source: །འདམ་ལས་རྒལ་ཏེ་སེམས་ཅན་རྣམས་ཀྱང་འདུལ།
en: Escaping the swamp, they guide beings.

source: །གང་ཚེ་ཆོས་རྣམས་གསོག་དང་གསོབ་ཏུ་གཟིགས།
en: When phenomena are seen as compounded and fake,

source: །ནམ་མཁའ་ཆང་སྟོང་འདྲ་ཞིང་སྙིང་པོ་མེད།
en: They are seen to be totally empty and insubstantial like the sky.

source: །དེ་དག་བདག་གི་ངོ་བོ་མ་མཆིས་པས།
en: “As they are without self-nature,

source: །བདག་མེད་དངོས་མེད་དངོས་པོ་མེད་མ་ལགས།
en: They are not self, neither entity nor nonentity.

source: །མཐའ་རྣམས་ཀུན་ཏུ་ལྟ་བ་ཀུན་སྤངས་ན།
en: If all extreme views are abandoned,

source: །བྱང་ཆུབ་རྡུལ་མེད་རྣམ་དག་ཐོབ་པར་འགྱུར།
en: Pure and immaculate awakening will be achieved.

source: །སྐྱེ་དང་རྒ་དང་གནོད་པར་བགྱི་བ་གང་།
en: “There is no one at all who undergoes birth, aging, harm,

source: །འཆི་དང་གནས་པ་གང་ལགས་སུ་ཡང་མེད།
en: Dying, or living.

source: །གང་འདིར་སྐྱེ་དང་རྒ་དང་ན་དང་འཆི།
en: Whoever is born, ages, gets sick, and dies

source: །ཤེད་ལས་སྐྱེས་དང་ཤེད་བུ་དེ་མ་མཆིས།
en: Is born from humans, yet that human does not exist.

source: །འདི་ན་བདག་དང་བདག་གི་མ་མཆིས་ཏེ།
en: “In this way, there is no me or mine

source: །གང་ཟག་ཤེས་སྐྱེས་ཤེད་བུ་ཡོང་མ་མཆིས།
en: No humans or any human race.

source: །འདི་བརྫུན་བདག་པོ་མ་མཆིས་དབང་མ་མཆིས།
en: It is all a lie, because there is no owner or master.

source: །འཚོ་བའི་འཇིག་རྟེན་སྒྱུ་མ་ལྟ་བུར་འཇུག །བྱེད་པ་མ་མཆིས་ཚོར་བ་པོ་མ་མཆིས།
en: So one perceives the living world to be an illusion. “There is no creator and no one experiencing.

source: །འོན་ཀྱང་ལས་མཆིས་འབྲས་བུ་དོན་མ་མཆིས།
en: Yet, due to karma, nonexistent fruits appear.
